In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [9]:
df= pd.read_csv('Sales(1).csv')
print(df.to_string())

   Order ID  Customer Name   Order Date   Product  Quantity  Unit Price  Total Revenue
0      1001       John Doe   01/01/2024  Widget A      10.0        25.0          250.0
1      1002     Jane Smith   01/02/2024  Widget B       5.0        40.0          200.0
2      1003            NaN  2024/01/03'  Widget A       NaN        25.0            NaN
3      1004  Alice Johnson   04/01/2024  Widget C       3.0         NaN          210.0
4      1005      Bob Brown  2024/01/05'  Widget B      10.0        40.0          400.0
5      1006       John Doe   06/01/2024  Widget A       4.0        25.0          100.0
6      1001       John Doe   01/01/2024  Widget A      10.0        25.0          250.0
7      1007     Jane Smith   07/01/2024  Widget C      -6.0        70.0         -420.0

In [11]:
df.tail()

,Order ID,Customer Name,Order Date,Product,Quantity,Unit Price,Total Revenue
3,1004,Alice Johnson,04/01/2024,Widget C,3.0,NaN,210.0
4,1005,Bob Brown,2024/01/05',Widget B,10.0,40.0,400.0
5,1006,John Doe,06/01/2024,Widget A,4.0,25.0,100.0
6,1001,John Doe,01/01/2024,Widget A,10.0,25.0,250.0
7,1007,Jane Smith,07/01/2024,Widget C,-6.0,70.0,-420.0

In [12]:
df.tail(3)

,Order ID,Customer Name,Order Date,Product,Quantity,Unit Price,Total Revenue
5,1006,John Doe,06/01/2024,Widget A,4.0,25.0,100.0
6,1001,John Doe,01/01/2024,Widget A,10.0,25.0,250.0
7,1007,Jane Smith,07/01/2024,Widget C,-6.0,70.0,-420.0

In [18]:
df.loc[8] = ['1008', 'Rugambwa', '08/01/2024', 'Widget A', 4.2, 30.0, 300.0]

In [19]:
df['Discount'] = 0

In [22]:
print(df.columns)

Index(['Order ID', 'Customer Name', 'Order Date', 'Product', 'Quantity',
       'Unit Price', 'Total Revenue', 'Discount'],
      dtype='object')

In [24]:
df.loc[9]=['1009', 'Rugambwa', '08/01/2024', 'Widget A', 4.2, 30.0, 300.0, 0]

In [26]:
df.to_clipboard

<bound method NDFrame.to_clipboard of   Order ID  Customer Name   Order Date   Product  Quantity  Unit Price  \
0     1001       John Doe   01/01/2024  Widget A      10.0        25.0
1     1002     Jane Smith   01/02/2024  Widget B       5.0        40.0
2     1003            NaN  2024/01/03'  Widget A       NaN        25.0
3     1004  Alice Johnson   04/01/2024  Widget C       3.0         NaN
4     1005      Bob Brown  2024/01/05'  Widget B      10.0        40.0
5     1006       John Doe   06/01/2024  Widget A       4.0        25.0
6     1001       John Doe   01/01/2024  Widget A      10.0        25.0
7     1007     Jane Smith   07/01/2024  Widget C      -6.0        70.0
8     1008       Rugambwa   08/01/2024  Widget A       4.2        30.0
9     1009       Rugambwa   08/01/2024  Widget A       4.2        30.0

   Total Revenue  Discount
0          250.0         0
1          200.0         0
2            NaN         0
3          210.0         0
4          400.0         0
5          100.0         0
6          250.0         0
7         -420.0         0
8          300.0         0
9          300.0         0  >

In [29]:
df['Discount']=[10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
df['Discount'] = df['Discount'].astype(float)
df.to_string

<bound method DataFrame.to_string of   Order ID  Customer Name   Order Date   Product  Quantity  Unit Price  \
0     1001       John Doe   01/01/2024  Widget A      10.0        25.0
1     1002     Jane Smith   01/02/2024  Widget B       5.0        40.0
2     1003            NaN  2024/01/03'  Widget A       NaN        25.0
3     1004  Alice Johnson   04/01/2024  Widget C       3.0         NaN
4     1005      Bob Brown  2024/01/05'  Widget B      10.0        40.0
5     1006       John Doe   06/01/2024  Widget A       4.0        25.0
6     1001       John Doe   01/01/2024  Widget A      10.0        25.0
7     1007     Jane Smith   07/01/2024  Widget C      -6.0        70.0
8     1008       Rugambwa   08/01/2024  Widget A       4.2        30.0
9     1009       Rugambwa   08/01/2024  Widget A       4.2        30.0

   Total Revenue  Discount
0          250.0      10.0
1          200.0      20.0
2            NaN      30.0
3          210.0      40.0
4          400.0      50.0
5          100.0      60.0
6          250.0      70.0
7         -420.0      80.0
8          300.0      90.0
9          300.0     100.0  >

In [30]:
df.isna().sum()

Order ID         0
Customer Name    1
Order Date       0
Product          0
Quantity         1
Unit Price       1
Total Revenue    1
Discount         0
dtype: int64

In [32]:
df.nunique()

Order ID          9
Customer Name     5
Order Date        8
Product           3
Quantity          6
Unit Price        4
Total Revenue     7
Discount         10
dtype: int64

In [33]:
df['Customer Name'].unique()

array(['John Doe', 'Jane Smith', nan, 'Alice Johnson', 'Bob Brown',
       'Rugambwa'], dtype=object)

In [34]:
df['Customer Name'].value_counts()

Customer Name
John Doe         3
Jane Smith       2
Rugambwa         2
Alice Johnson    1
Bob Brown        1
Name: count, dtype: int64

In [36]:
print(df.to_string())

  Order ID  Customer Name   Order Date   Product  Quantity  Unit Price  Total Revenue  Discount
0     1001       John Doe   01/01/2024  Widget A      10.0        25.0          250.0      10.0
1     1002     Jane Smith   01/02/2024  Widget B       5.0        40.0          200.0      20.0
2     1003            NaN  2024/01/03'  Widget A       NaN        25.0            NaN      30.0
3     1004  Alice Johnson   04/01/2024  Widget C       3.0         NaN          210.0      40.0
4     1005      Bob Brown  2024/01/05'  Widget B      10.0        40.0          400.0      50.0
5     1006       John Doe   06/01/2024  Widget A       4.0        25.0          100.0      60.0
6     1001       John Doe   01/01/2024  Widget A      10.0        25.0          250.0      70.0
7     1007     Jane Smith   07/01/2024  Widget C      -6.0        70.0         -420.0      80.0
8     1008       Rugambwa   08/01/2024  Widget A       4.2        30.0          300.0      90.0
9     1009       Rugambwa   08/01/2024  Widget A       4.2        30.0          300.0     100.0

In [37]:
df['Quantity'].unique()

array([10. ,  5. ,  nan,  3. ,  4. , -6. ,  4.2])

In [44]:
df=df.drop(['Discount'], axis=1)
df.head()

  Order ID  Customer Name   Product  Quantity  Unit Price  Total Revenue
0     1001       John Doe  Widget A      10.0        25.0          250.0
1     1002     Jane Smith  Widget B       5.0        40.0          200.0
2     1003            NaN  Widget A       NaN        25.0            NaN
3     1004  Alice Johnson  Widget C       3.0         NaN          210.0
4     1005      Bob Brown  Widget B      10.0        40.0          400.0